site/static/logs/gateway-64/64/aspnet-minimal_nginx.h2load.run2.txt
starting benchmark...
spawning thread #0: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #1: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #2: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #3: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #4: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #5: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #6: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #7: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #8: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #9: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #10: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #11: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #12: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #13: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #14: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #15: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #16: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #17: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #18: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #19: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #20: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #21: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #22: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #23: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #24: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #25: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #26: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #27: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #28: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #29: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #30: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #31: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #32: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #33: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #34: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #35: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #36: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #37: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #38: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #39: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #40: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #41: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #42: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #43: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #44: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #45: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #46: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #47: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #48: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #49: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #50: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #51: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #52: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #53: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #54: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #55: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #56: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #57: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #58: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #59: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #60: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #61: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #62: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #63: 1 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
Warm-up started for thread #63.
Warm-up started for thread #6.
Warm-up started for thread #9.
Warm-up started for thread #4.
Warm-up phase is over for thread #63.
Main benchmark duration is started for thread #63.
Warm-up phase is over for thread #6.
Warm-up started for thread #Main benchmark duration is started for thread #6.
28.
Warm-up phase is over for thread #9.
Main benchmark duration is started for thread #9.
Warm-up started for thread #13.
Warm-up phase is over for thread #4.
Main benchmark duration is started for thread #4.
Warm-up started for thread #0.
Warm-up phase is over for thread #28.
Main benchmark duration is started for thread #28.
Warm-up phase is over for thread #13.
Main benchmark duration is started for thread #13.
Warm-up started for thread #3.
progress: 100% of clients started
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up started for thread #53.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Warm-up started for thread #10.
Warm-up started for thread #7.
Warm-up phase is over for thread #53.
Main benchmark duration is started for thread #53.
Warm-up started for thread #23Warm-up phase is over for thread #.
7.
Main benchmark duration is started for thread #7.
Warm-up phase is over for thread #10.
Main benchmark duration is started for thread #10.
Warm-up started for thread #5.
Warm-up started for thread #11.
Warm-up phase is over for thread #Warm-up started for thread #238..

Main benchmark duration is started for thread #23.
Warm-up phase is over for thread #11.
Main benchmark duration is started for thread #11.
Warm-up phase is over for thread #5.
Main benchmark duration is started for thread #5.
Warm-up started for thread #15.
Warm-up started for thread #16.
Warm-up phase is over for thread #8.
Main benchmark duration is started for thread #8.
Warm-up started for thread #17.
Warm-up phase is over for thread #16.
Main benchmark duration is started for thread #16.
Warm-up started for thread #12.
Warm-up phase is over for thread #15.
Main benchmark duration is started for thread #15.
Warm-up phase is over for thread #Warm-up phase is over for thread #1712.
Main benchmark duration is started for thread #17.
.
Main benchmark duration is started for thread #12.
Warm-up started for thread #14.
Warm-up started for thread #22.
Warm-up phase is over for thread #22.
Main benchmark duration is started for thread #22.
Warm-up started for thread #18.
Warm-up phase is over for thread #14.
Main benchmark duration is started for thread #14.
Warm-up started for thread #24.
Warm-up phase is over for thread #18.
Main benchmark duration is started for thread #18.
Warm-up phase is over for thread #24.
Main benchmark duration is started for thread #24.
Warm-up started for thread #1.
Warm-up started for thread #19.
Warm-up phase is over for thread #Warm-up started for thread #25.
1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #19.
Main benchmark duration is started for thread #19.
Warm-up started for thread #26.
Warm-up phase is over for thread #25.
Main benchmark duration is started for thread #25.
Warm-up started for thread #21.
Warm-up started for thread #20.
Warm-up started for thread #60.
Warm-up phase is over for thread #21.
Main benchmark duration is started for thread #21.
Warm-up started for thread #42.
Warm-up phase is over for thread #26.
Main benchmark duration is started for thread #26.
Warm-up phase is over for thread #20.
Main benchmark duration is started for thread #20.
Warm-up phase is over for thread #60.
Main benchmark duration is started for thread #60.
Warm-up started for thread #44.
Warm-up phase is over for thread #42.
Main benchmark duration is started for thread #42.
Warm-up started for thread #40.
Warm-up started for thread #41.
Warm-up started for thread #35.
Warm-up phase is over for thread #44.
Main benchmark duration is started for thread #44.
Warm-up phase is over for thread #40Warm-up started for thread #.
Warm-up phase is over for thread #41.
Main benchmark duration is started for thread #41.
43.
Main benchmark duration is started for thread #40.
Warm-up started for thread #32.
Warm-up phase is over for thread #35.
Main benchmark duration is started for thread #35.
Warm-up started for thread #61.
Warm-up phase is over for thread #43.
Main benchmark duration is started for thread #43.
Warm-up phase is over for thread #32Warm-up started for thread #.46.

Main benchmark duration is started for thread #32.
Warm-up phase is over for thread #61.
Main benchmark duration is started for thread #61.
Warm-up phase is over for thread #46.
Main benchmark duration is started for thread #46.
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up started for thread #47.
Warm-up started for thread #29.
Warm-up phase is over for thread #47.
Main benchmark duration is started for thread #47.
Warm-up started for thread #34.
Warm-up phase is over for thread #29.
Main benchmark duration is started for thread #29.
Warm-up started for thread #38.
Warm-up started for thread #62.
Warm-up phase is over for thread #34.
Main benchmark duration is started for thread #34.
Warm-up phase is over for thread #38.
Main benchmark duration is started for thread #38.
Warm-up started for thread #51.
Warm-up phase is over for thread #62.
Main benchmark duration is started for thread #62.
Warm-up started for thread #50.
Warm-up started for thread #36.
Warm-up started for thread #48.
Warm-up phase is over for thread #50.
Main benchmark duration is started for thread #50.
Warm-up phase is over for thread #51.
Main benchmark duration is started for thread #51.
Warm-up phase is over for thread #36.
Main benchmark duration is started for thread #36.
Warm-up phase is over for thread #48.
Main benchmark duration is started for thread #48.
Warm-up started for thread #2.
Warm-up started for thread #49.
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
Warm-up phase is over for thread #49.
Main benchmark duration is started for thread #49.
Warm-up started for thread #55.
Warm-up started for thread #52.
Warm-up started for thread #58.
Warm-up phase is over for thread #55.
Main benchmark duration is started for thread #55.
Warm-up started for thread #57.
Warm-up phase is over for thread #52.
Main benchmark duration is started for thread #52.
Warm-up started for thread #45.
Warm-up phase is over for thread #58.
Main benchmark duration is started for thread #58.
Warm-up started for thread #56.
Warm-up phase is over for thread #57.
Main benchmark duration is started for thread #57.
Warm-up phase is over for thread #45.
Main benchmark duration is started for thread #45.
Warm-up started for thread #33.
Warm-up phase is over for thread #56.
Main benchmark duration is started for thread #56.
Warm-up started for thread #27.
Warm-up started for thread #54.
Warm-up phase is over for thread #33.
Main benchmark duration is started for thread #33.
Warm-up phase is over for thread #27.
Main benchmark duration is started for thread #27.
Warm-up phase is over for thread #54.
Main benchmark duration is started for thread #54.
Warm-up started for thread #31.
Warm-up started for thread #39.
Warm-up started for thread #37.
Warm-up phase is over for thread #31.
Main benchmark duration is started for thread #31.
Warm-up started for thread #30.
Warm-up phase is over for thread #39.
Main benchmark duration is started for thread #39.
Warm-up started for thread #59.
Warm-up phase is over for thread #37.
Main benchmark duration is started for thread #37.
Warm-up phase is over for thread #30.
Warm-up phase is over for thread #Main benchmark duration is started for thread #3059..
Main benchmark duration is started for thread #59.

Process Request Failure:3488
Process Request Failure:3490
Process Request Failure:3488
Process Request Failure:3488
Process Request Failure:3495
Main benchmark duration is over for thread #9. Stopping all clients.
Stopped all clients for thread #9
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3
Main benchmark duration is over for thread #13. Stopping all clients.
Stopped all clients for thread #13
Main benchmark duration is over for thread #6. Stopping all clients.
Stopped all clients for thread #6
Main benchmark duration is over for thread #4. Stopping all clients.
Stopped all clients for thread #4
Main benchmark duration is over for thread #63. Stopping all clients.
Stopped all clients for thread #63
Main benchmark duration is over for thread #53. Stopping all clients.
Stopped all clients for thread #53
Main benchmark duration is over for thread #10. Stopping all clients.
Stopped all clients for thread #10
Main benchmark duration is over for thread #7. Stopping all clients.
Stopped all clients for thread #7
Main benchmark duration is over for thread #28. Stopping all clients.
Stopped all clients for thread #28
Main benchmark duration is over for thread #5. Stopping all clients.
Stopped all clients for thread #5
Main benchmark duration is over for thread #15. Stopping all clients.
Stopped all clients for thread #15
Main benchmark duration is over for thread #16. Stopping all clients.
Stopped all clients for thread #16
Main benchmark duration is over for thread #23. Stopping all clients.
Stopped all clients for thread #23
Main benchmark duration is over for thread #11. Stopping all clients.
Stopped all clients for thread #11
Main benchmark duration is over for thread #18. Stopping all clients.
Stopped all clients for thread #18
Main benchmark duration is over for thread #8. Stopping all clients.
Stopped all clients for thread #8
Main benchmark duration is over for thread #24. Stopping all clients.
Stopped all clients for thread #24
Main benchmark duration is over for thread #14. Stopping all clients.
Stopped all clients for thread #14
Main benchmark duration is over for thread #17. Stopping all clients.
Stopped all clients for thread #17
Main benchmark duration is over for thread #12. Stopping all clients.
Stopped all clients for thread #12
Main benchmark duration is over for thread #22. Stopping all clients.
Stopped all clients for thread #22
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #26. Stopping all clients.
Stopped all clients for thread #26
Main benchmark duration is over for thread #60. Stopping all clients.
Stopped all clients for thread #60
Main benchmark duration is over for thread #21. Stopping all clients.
Stopped all clients for thread #21
Main benchmark duration is over for thread #25. Stopping all clients.
Stopped all clients for thread #25
Main benchmark duration is over for thread #19. Stopping all clients.
Stopped all clients for thread #19
Main benchmark duration is over for thread #42. Stopping all clients.
Stopped all clients for thread #42
Main benchmark duration is over for thread #20. Stopping all clients.
Stopped all clients for thread #20
Main benchmark duration is over for thread #41. Stopping all clients.
Stopped all clients for thread #41
Main benchmark duration is over for thread #43. Stopping all clients.
Stopped all clients for thread #43
Main benchmark duration is over for thread #40. Stopping all clients.
Stopped all clients for thread #40
Main benchmark duration is over for thread #61. Stopping all clients.
Stopped all clients for thread #61
Main benchmark duration is over for thread #35. Stopping all clients.
Stopped all clients for thread #35
Main benchmark duration is over for thread #32. Stopping all clients.
Stopped all clients for thread #32
Main benchmark duration is over for thread #46. Stopping all clients.
Stopped all clients for thread #46
Main benchmark duration is over for thread #44. Stopping all clients.
Stopped all clients for thread #44
Main benchmark duration is over for thread #47. Stopping all clients.
Stopped all clients for thread #47
Main benchmark duration is over for thread #29. Stopping all clients.
Stopped all clients for thread #29
Main benchmark duration is over for thread #34. Stopping all clients.
Stopped all clients for thread #34
Main benchmark duration is over for thread #62. Stopping all clients.
Stopped all clients for thread #62
Main benchmark duration is over for thread #50. Stopping all clients.
Stopped all clients for thread #50
Main benchmark duration is over for thread #48. Stopping all clients.
Stopped all clients for thread #48
Main benchmark duration is over for thread #38. Stopping all clients.
Stopped all clients for thread #38
Main benchmark duration is over for thread #51. Stopping all clients.
Stopped all clients for thread #51
Main benchmark duration is over for thread #36. Stopping all clients.
Stopped all clients for thread #36
Main benchmark duration is over for thread #49. Stopping all clients.
Stopped all clients for thread #49
Main benchmark duration is over for thread #52. Stopping all clients.
Stopped all clients for thread #52
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2
Main benchmark duration is over for thread #55. Stopping all clients.
Stopped all clients for thread #55
Main benchmark duration is over for thread #45. Stopping all clients.
Stopped all clients for thread #45
Main benchmark duration is over for thread #58. Stopping all clients.
Stopped all clients for thread #58
Main benchmark duration is over for thread #56. Stopping all clients.
Stopped all clients for thread #56
Main benchmark duration is over for thread #57. Stopping all clients.
Stopped all clients for thread #57
Main benchmark duration is over for thread #54. Stopping all clients.
Stopped all clients for thread #54
Main benchmark duration is over for thread #39. Stopping all clients.
Stopped all clients for thread #39
Main benchmark duration is over for thread #31. Stopping all clients.
Stopped all clients for thread #31
Main benchmark duration is over for thread #33. Stopping all clients.
Stopped all clients for thread #33
Main benchmark duration is over for thread #27. Stopping all clients.
Stopped all clients for thread #27
Main benchmark duration is over for thread #59. Stopping all clients.
Stopped all clients for thread #59
Main benchmark duration is over for thread #37. Stopping all clients.
Stopped all clients for thread #37
Main benchmark duration is over for thread #30. Stopping all clients.
Stopped all clients for thread #30

finished in 5.04s, 80670.40 req/s, 3.47GB/s
requests: 403389 total, 405277 started, 403389 done, 262377 succeeded, 141012 failed, 37 errored, 0 timeout
status codes: 262383 2xx, 0 3xx, 140975 4xx, 0 5xx
traffic: 17.36GB (18636313046) total, 28.57MB (29962187) headers (space savings 40.58%), 17.30GB (18580866577) data
                     min         max         mean         sd        +/- sd
time for request:      132us     98.61ms     24.59ms     12.73ms    67.58%
time for connect:     2.87ms     11.78ms      6.75ms      2.00ms    62.50%
time to 1st byte:     3.28ms     49.34ms     19.43ms     11.15ms    64.06%
req/s           :     879.79     5474.67     1361.59      692.47    92.19%